[
  {
    "path": "posts/2021-05-22-dataviz-2/",
    "title": "DataViz Makeover #2",
    "description": "A second evaluation of Singapore's Merchandize Trade over a longer timeline and more countries.",
    "author": [
      {
        "name": "Lim Jiahui, Masters of IT in Business (Analytics)",
        "url": "https://www.linkedin.com/in/lim-jiahui-171104151/"
      }
    ],
    "date": "2021-06-06",
    "categories": [],
    "contents": "\r\n\r\nContents\r\n1. Introduction\r\n2. Evaluation2.1 Clarity\r\n2.2 Aesthetics\r\n\r\n3. Proposed Visualization Design3.2 Advantages of New Design\r\n\r\n4. Step-by-Step Methodology4.1 Data Source\r\n4.2 Data Preparation\r\n4.3 Data Visualization (1st Chart)\r\n4.4 Data Visualization (2nd Chart)\r\n4.5 Dashboard\r\n\r\n5. Final VisualizationMain Observations\r\n\r\n\r\n\r\nThis post was written as part of requirements for Visual Analytics course in MITB.\r\n\r\n1. Introduction\r\nFor many countries, Singapore serves as an important port for trades and also heavily rely on imported goods for the country’s usage. Trades primarily consist of imports and exports, where imports refer to goods brought into Singapore irrespective of the uses, while exports refer to goods brought out of the country. In order to understand the movement of goods in Singapore, data visualization is important to help us discover meaningful insights that could potentially drive better decision-making and improvement of Singapore’s trades.\r\nIn this post, the original visualization chart of Singapore’s Merchandise Trade from SingStat will be critically reviewed and an improved alternate interactive design will be proposed.\r\n2. Evaluation\r\nThe original chart is as shown below, where it consists of 10 trading regions (China, Malaysia, United States, European Union, Taiwan, Korea, Japan, Indonesia, Thailand and Hong Kong) between a time period of January 2011 to December 2020.\r\nFigure 2.1: Original Chart from SingstatBefore evaluating the chart, primary research on the visualization was conducted in order to understand what are the purposes of this graph as well as key takeaways for the readers.\r\nAudience: Government Agencies, policy-makers, businesses and individuals\r\nPurpose: To have a clear overview on the trade volume comparison between imports and exports of Singapore and the 10 trading partners between a fixed time period of 2011 to 2020.\r\n2.1 Clarity\r\nS/N\r\nCritique\r\nApproach\r\n1\r\n\r\n\r\n2\r\n\r\n\r\n2.2 Aesthetics\r\nS/N\r\nCritique\r\nApproach\r\n1\r\n\r\n\r\n2\r\n\r\n\r\n3. Proposed Visualization Design\r\n3.2 Advantages of New Design\r\n4. Step-by-Step Methodology\r\n4.1 Data Source\r\nWe will be using the same datasets of “import.csv” and “export.csv” as DataViz Makeover #1.\r\n4.2 Data Preparation\r\nAs the raw dataset consists of multiple unwanted rows, columns and ‘NA’ values, we will be doing some pre-processing on Tableau Desktop.\r\n\r\nSteps\r\nDescription\r\n1\r\nImport the raw dataset into Tableau Desktop. From there, we can see 2 different tables - T1 and T2.Click on New Union and drag both T1 and T2 and select Apply.\r\n2\r\nThe data table will be stacked and it should look something like this:  Notice that the structure of the table is wrong, thus we can click on Cleaned with Data Interpreter at the side pane and it will automatically detect the exact table structure.The data table should now look like this:\r\n3\r\nNext, we will filter the countries from Variables table to the 10 countries of interest. At the top right hand corner of the page, click on the Add Filter. Then, we will add the filter for Variables and select the countries (including the total exports and imports) accordingly. \r\n4\r\nWe will now filter the dates to January 2011 to December 2020. Shift and hold to select all unwanted columns, right click and select Hide. \r\n5\r\nTo convert the date columns to rows, we will use the Pivot function by right clicking the selected columns.  We can then rename the pivoted columns accordingly.\r\n6\r\nThen, we shall rename the variables to shorter words. At the top right hand of the column, click on the tiny triangle and select Aliases.  We can then edit the names accordingly as shown below. We can also rename the Table Name to Exports and Imports accordingly.\r\n7\r\nNote that only European Union is in SGD Millon Dollars, while the rest are in SGD Thousands. As the numbers are all big, we will standardize across all values to SGD Billion Dollars. Create a Calculated Field from the mini triangle again.  Since the values for European Union are less than 5 digits, we can enter the following formula to the field and click Apply. \r\n8\r\nLastly, we shall change the Data type for the Date, from strings to Datetime format. \r\n\r\nViola! Our data is well-prepped and ready to be used for visual constructions.\r\n4.3 Data Visualization (1st Chart)\r\nFor this first chart, we will be examining the net exports and imports trade value based on each individual countries, using a diverging lollipop chart.\r\nOpen up a fresh empty worksheet, and drag Variables into Rows and Filters pane. Because the data source includes the total exports and imports by all global regions, we will filter it out to only visualize the 10 trading markets. Unselect the total exports and imports before clicking on Apply.\r\n\r\nFigure 4.3.1: Filtering Variables\r\nNext, we will create a calculated field to show the net trade values. Right-click onto the Data pane and click on Create Calculated Field. We will use an if-else function to multiply the SGD value to negative if it its imports (aka sheet = ‘T1’). Hence, we can apply the formula as shown in Fig 4.3.3 and rename it to “Trade Value Indicator”.\r\n\r\nFigure 4.3.1: Filtering VariablesFigure 4.3.1: Filtering Variables\r\n4.4 Data Visualization (2nd Chart)\r\nBar graph + 2 line charts\r\n4.5 Dashboard\r\nHighlighting\r\n5. Final Visualization\r\nMain Observations\r\n\r\nThat’s all for my dataviz makeover #2 post! Thanks for reading :)\r\n\r\nReferences\r\nInternational Monetary Fund, Singapore Merchandise Trade\r\nEconomics measurement of global trade\r\nWorld Integrated Trade Solution - measuring trade balance\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-06-14T01:03:44+08:00",
    "input_file": "dataviz-2.knit.md"
  },
  {
    "path": "posts/2021-05-21-dataviz-makeover-1/",
    "title": "DataViz Makeover #1",
    "description": "Changing of SingStat's Merchandize Trade Visualization using R and Tableau.",
    "author": [
      {
        "name": "Lim Jiahui, Masters of IT in Business (Analytics)",
        "url": "https://www.linkedin.com/in/lim-jiahui-171104151/"
      }
    ],
    "date": "2021-05-21",
    "categories": [],
    "contents": "\r\n\r\nContents\r\n1. Introduction\r\n2. Evaluation2.1 Clarity\r\n2.2 Aesthetics\r\n\r\n3. Proposed Visualization Design3.1 Sketched Design\r\n3.2 Advantages of New Design\r\n\r\n4. Step-by-Step Methodology4.1 Data Source\r\n4.2 Data Preparation\r\n4.3 Data Visualization (First Chart: Trade Volume and Balance)\r\n4.4 Data Visualization (Second Chart: Net Trade Volume)\r\n4.5 Dashboard\r\n\r\n5. Final VisualizationMain Observations\r\n\r\n\r\n\r\nThis post was written as part of requirements for Visual Analytics course in MITB.\r\n\r\n1. Introduction\r\nFor many countries, Singapore serves as an important port for trades and also heavily rely on imported goods for the country’s usage. Trades primarily consist of imports and exports, where imports refer to goods brought into Singapore irrespective of the uses, while exports refer to goods brought out of the country. In order to understand the movement of goods in Singapore, data visualization is important to help us discover meaningful insights that could potentially drive better decision-making and improvement of Singapore’s trades.\r\nIn this post, the original visualization chart of Singapore’s Merchandise Trade from SingStat will be critically reviewed and an improved alternative design will be proposed.\r\n2. Evaluation\r\nThe original chart is as shown below, and it mainly consists of top 6 trading countries between a time period of 2019-2021. The graphs were plotted based on their exports and imports across the time period.\r\nFigure 2.1: Original Chart from SingstatBefore evaluating the chart, primary research on the visualization was conducted in order to understand what are the purposes of this graph as well as key takeaways for the readers.\r\nAudience: Government Agencies, policy-makers, businesses and individuals\r\nPurpose: To have a clear overview on changes in trade volume (between exports and imports) of Singapore and its top 6 countries between 2019 to 2021, especially since it was during the Covid-19 pandemic.\r\n2.1 Clarity\r\nS/N\r\nCritique\r\nApproach\r\n1\r\nWrong choice of graph type (original chart uses area graph), as this causes overlapping and makes it difficult to read the values\r\nChange the graph type to either bar chart or line chart to show distinct changes. Additionally, plot the imports and exports separately so as to have a clearer view for each type of trade.\r\n2\r\nThe overlapping of area graph introduces a new color, which is also not included in the legend properly.\r\nEnsure all variables are labeled/annotated/represented properly in the chart.\r\n3\r\nValues in Axes on both ends have different units, thus making it hard to read\r\nSynchronize the axis and convert all values for imports and exports to the same units.\r\n4\r\nInconsistent representation of the time period among all countries. Japan has only time period of 2020, while the rest consists of trades from 2019-2020. This reduced the accuracy in the comparison between all 6 countries.\r\nClean up data and re-organize it to make sure ALL countries’ data are included.\r\n5\r\nLegend title is named as “Measure Names”, which is clearly misleading.\r\nNaming of the legends need to be edited properly.\r\n6\r\nThe title of each graph is just the country names, but does not annotate what the graph actually means.\r\nInclude a clear title that summarizes the whole plot.\r\n2.2 Aesthetics\r\nS/N\r\nCritique\r\nApproach\r\n1\r\nSize of all 6 charts are relatively small and hard to read.\r\nThis might be due to each country being plotted separately, hence we will combine all to make into a single plot of same axis.\r\n2\r\nFont size used in the Chart Header is almost as big (or smaller) as the headings for each graph.\r\nBold the chart header and use a bigger font size to represent the main objective of the graph.\r\n3\r\nMany blank areas and chart design is too “empty”.\r\nFill in the white spaces with some descriptions/captions/annotations, and also highlight any key features for the readers to take note of (eg. using different colours to represent increase/decrease)\r\n3. Proposed Visualization Design\r\n3.1 Sketched Design\r\nFigure 3.1.1: New Proposed Design on Sketch3.2 Advantages of New Design\r\nThere will be a clear title for the overall chart, including the 2 plots as well. Axes and legends will also be labeled properly. This will thus let the readers have a clearer understanding of the plots.\r\nThere will also be a few short captions/descriptions for the charts. This will thus provide more context to the overall plots.\r\nIn this new design, we will be able to see the distinct changes in exports and imports trade volume per country on the same plot. There won’t be any overlaps and thus making it easy to read.\r\nAs the imports and exports are all on the same chart, the timeline used will also be consistent for fair comparison. The axes will also be synchronized across all countries and converted to a better unit of measurement (SGD Billion) so that the numbers will not be too big for reading.\r\nThe use of colours will be introduced into the chart to highlight certain areas as well as showing of notable features.\r\n4. Step-by-Step Methodology\r\n4.1 Data Source\r\nThe raw excel data was downloaded from SingStat, and a preview of how the data looks like is shown below.\r\nFigure 4.1.1: Singapore Exports from 1976Figure 4.1.2: Singapore Imports from 1976As observed, the data was dated back from 1976 till 2021 in monthly basis. There are also many missing data (represented by “na”) and unnecessary top few rows.\r\n4.2 Data Preparation\r\nTo facilitate ease of data preparation, the raw dataset will first be uploaded onto Tableau Prep Builder for data selection. The steps noted below are based on table T1 (Imports Table), but the same steps can be applied for table T2 (Exports Table) as well.\r\nS/N\r\nTableau Prep Builder Description\r\n1\r\nClick on “Connect data”, followed by “Microsoft Excel” to upload the raw dataset.\r\n2\r\nDrag table T1 into the empty pane.Notice that Tableau did not capture the headers and variables properly, hence we can click on “Use Data Interpreter” at the left side of the page. The final preview of the table shows the proper table inputs and field names.\r\n3\r\nNow, we can create a workflow for filtering of the data based on relevancy.At the top of the page, click on the “+” sign and select “Clean Step”.The preview will now show the interpreter data table.\r\n4\r\nSince the original chart only focuses on top 6 countries, we should filter the countries accordingly too.At the variables column, select the “More Options”, followed by “Filter” and “Selected Values”. We will then select the countries accordingly (including the total trades) as shown in the diagram above.\r\n5\r\nIn addition, the data of interest ranges from 2019 onwards. Hence, we will select only the fields from “2019 Jan” to “2021 Apr” and remove the rest using the “Remove Fields” button on top. The final preview of the table is as shown below. \r\n6\r\nFinally, the table shows no “null” values and thus we can save this table into an external xlsx file for further exploration on Tableau Desktop. At the top, click on the “+” sign and select “Output”.  Select “xlsx” as the output type and navigate to the directory where you wish to save the file at.\r\n\r\nTable 4.2.1: Tableau Prep Builder Steps\r\nRepeat the same steps as above for the Export Table. For easier reference, we shall combine both Imports.xlsx and Exports.xlsx into one excel worksheet before uploading into Tableau Desktop.\r\nS/N\r\nTableau Desktop Description\r\n1\r\nImport the dataset into Tableau Desktop and drag the tables into the empty space as shown below.\r\n2\r\nTo facilitate cross-referencing in the graphs later, we will create a “Union” between the 2 tables. Click on the “New Union” at the side bar and drag in both Import and Export tables.Click “ok” and the output will look like the diagram below, which both tables values together. \r\n3\r\nNext, we will make the dates as rows by pivoting for the table. Select all the dates and right click followed by “Pivot”. The table will now look like this: We will then rename the column names accordingly by double clicking at the headers for easier reference. \r\n4\r\nNotice that the dates are in strings data type based on the tiny label “Abc” on the top left corner at the columns. In this case, we will convert the data type into “Date” format in both Export and Import. \r\n5\r\nWe can also change the data type of the Variables column from strings to country, as it might be easier for us to conduct geospatial mapping later. To do so, click on the “Abc” logo again and hover on the “Geographical role” to select on “Country/Region”. \r\n6\r\nIn addition, we can see that only America is expressed in Million Dollars (SGD), while the rest are in Thousands. Hence, we will convert all the values into the same units (Billion Dollars) since the numbers are relatively large. Select the values column and right click on the “Calculated Field” function.  Based on a brief scan across the table, it shows that America values are less than 5 figures, hence we can enter the syntax as this: After applying the changes, our table values now looks better. We shall rename the column names as well. \r\n7\r\nNow, we will rename the variables to make it shorter and easier to read. Select the variables column and right click on “Aliases”.A second window will pop up, and double click on the _“Value (Alias)” to edit the names accordingly. \r\n8\r\nAfter all the above steps, the final overview of the tables should look something like this: \r\n\r\nTable 4.2.2: Tableau Desktop Steps\r\nThe table is now ready to be used for constructing of visualizations.\r\n4.3 Data Visualization (First Chart: Trade Volume and Balance)\r\nIn this first chart, we will be creating a line and bar chart congregated onto a single axis for an easier overview in both trade volumes and balance between exports and imports.\r\nSetting up of Plot\r\nOpen up the first sheet tab of Tableau, and we can see the Tables Pane like this:\r\n\r\nFigure 4.3.1: Setting up worksheet in Tableau\r\nDrag variables “Country”, “Date” and “SGD (Billion)” into the “Columns” and “Rows”, and you can see the plot as follows:\r\nFigure 4.3.2: Inputting Variables to plotNote that the date of interest is from 2019-2020, and only the top 6 countries to be selected. Hence, we will do a “Filters”, by dragging in “Country” and “Date” into the section. We will de-select on “Total Exports” and “Total Imports” for the “Country”, while de-selecting “2021” option in the Years for “Date”. We will then click on “Apply” and the changes will occur accordingly.\r\n\r\nFigure 4.3.3: Filtering VariablesFigure 4.3.4: Filtering Timeline\r\nNext, we will change the graph into a bar chart by selecting it from the “Marks” pane. We will also change the formatting for “Date” from the drop down, and als click on the “+” sign next to “Date” again to display the quarters as well. Hence, the steps and plot becomes like this:\r\n\r\nFigure 4.3.5: Bar ChartFigure 4.3.6: Altering the timelineFigure 4.3.7: Output of Bar Chart after changes to timeline\r\nIn order to plot both exports and imports on the same axis, we have to create a calculated field (right click at the left pane) as shown below in Figure 4.3.8.\r\nWe will then replace the variables in the rows, from “SGD (Billion)” to the new calculated field “Balance”.\r\nAfter that, drag the “Type” variable into the “Color” at Marks pane and we will get the diverging graph as seen in Figure 4.3.10.\r\n\r\n\r\nFigure 4.3.8: Creating calculated fieldFigure 4.3.9: Formula used in the calculated field named “Balance”Figure 4.3.10: Output after manipulation - Vertical Diverging Graph\r\nNow, we will add in the line graph that calculates the trade balance onto the same plot.\r\nDrag the “Balance” variable into the rows and change it into a line graph.Then, right click on the botton axis and click on “Dual Axis”.\r\nWe will also synchronize the axis to re-organize the chart by right clicking the axis.\r\nIn case the line graph doesn’t show, we can realign the order by formatting the axis and selecting the marks to be brought forwards.\r\nViola! We have our combined diverging chart ready! You can change the colours of the lines/bar graph to make it more prominent.\r\n\r\n\r\nFigure 4.3.11: Creating Dual Axis with Line Graph #1Figure 4.3.12: Creating Dual Axis with Line Graph #2Figure 4.3.13: Creating Dual Axis with Line Graph #3Figure 4.3.14: Creating Dual Axis with Line Graph #4Figure 4.3.15: Output of Line and Bar Graphs together on same axis\r\nCustomization\r\nTo distinguish the important features of the graph, we will change the colours or formatting to make the features more prominent and pleasing to the eye. There are 4 main features to go about: \r\nEditing the title of axes and adding in labels, markers:\r\nDrag the “Balance” variable into the “Label” portion at the Marks for line graph.\r\nAdd in markers (under “Color”) to the lines for better identification.\r\nEdit the axes title by double clicking it.\r\n\r\nChange the colours of the bar chart to colours that are more pleasing to the eye.\r\nAdd in differentiating colours for negative and positive values in the trade balance by dragging “Balance” to “Color” in the Marks pane. Edit the colors into 2 steps that centered at 0, as shown in Figure 4.3.16.\r\n\r\n\r\nFigure 4.3.16: Creating 2-stepped color\r\nChanging the labels on the axis to positive values:\r\nAs imports are positive values originally, we will edit it accordingly on the axis. Firstly, right click on either axis, then click “Format”.\r\nUnder the “Axis” section, select the “Numbers”, click “Custom” and enter the format as shown below in Figure 4.3.17.\r\n\r\n\r\nFigure 4.3.17: Reformatting axis to become all positive\r\nEdit the “Tooltip” to reflect the timeline, units, trade volume and balance.\r\nAfter all the steps above, the final chart should look something like this:\r\nFigure 4.3.18: Final Output of First Chart - Trade Volume and Balance4.4 Data Visualization (Second Chart: Net Trade Volume)\r\nThis chart will be a simple visualization to the net exports and imports per year across the different countries.\r\nSetting up of Plot\r\nOpen up an empty sheet and drag in “Country”, “Date” to columns while “Type” into the rows. (Refer to top few steps if unsure) Leave the dates as yearly values.\r\nAs usual, filter the years to 2019-2020 and remove both “Total Exports” and “Total Imports”.\r\nNote that a table of missing values is now created, thus we will drag in “SGD (Billion)” to the “Text” section in the Marks pane.\r\nTo create colours in visualizing the change of net trade volume, we will be switching to a highlight table instead. On the top right corner of the page, click on “Show Me” and select the “Highlight Table” as shown in the diagram below.\r\n\r\nFigure 4.4.1: Changing chart type to Highlighted Table\r\nGreat! Our second chart is almost done, just need to touch up on the colours and display!\r\nCustomization\r\nSimilar to the first chart, we would like our visuals to highlight the key features.\r\nChange the colours of the table.\r\nAt the Marks pane, edit the “SGD (Billion)” under “Colors” and compute using the difference across pane.\r\nWe will be using the full spectrum of the diverging colours by checking the “Use Full Color Range”.\r\n\r\n\r\nFigure 4.4.2: Computing difference across pane #1Figure 4.4.3: Computing difference across pane #2Figure 4.4.4: Creating diverging colors to show the differences\r\nAdding in Subtotals and Grand Totals\r\nTo show the overall values, we can add in the totals by clicking onto the tab “Analysis”, followed by “Totals” and selecting the “Add All Subtotals” as well as “Show Row Grand Totals”.\r\n\r\n\r\nFigure 4.4.5: Addition of Subtotals and Grand Totals to the Table\r\nRename the axes and title of the chart for better understanding. After all the steps above, the final chart should look something like this:\r\nFigure 4.4.6: Final output of Second Chart - Net Trade Volume4.5 Dashboard\r\nFinally, we can compile all the charts into the dashboard.\r\nFirst, open up an empty dashboard and set the size of it to “Automatic”.\r\n\r\nFigure 4.5.1: Empty New Dashboard pageFigure 4.5.2: Setting the size of Dashboard\r\nDrag in both sheets into the empty dashboard. Make sure to format the layout of all charts,legends and text into “Floating”. This will allow to resize and reorganize our dashboard easily to wherever we want.\r\n\r\nFigure 4.5.3: Creating “Floating” Charts and Diagrams\r\nInclude a header for the dashboard by checking the “Show dashboard title”.\r\n\r\nFigure 4.5.4: Including Dashboard Header\r\nInclude captions, text or description. To do so, drag the “Text” object into the dashboard and format it to “Floating”. Edit the text accordingly to information or findings from the chart.\r\n5. Final Visualization\r\nFigure 5.1: Singapore Merchandise Trade with Top Six Countries, 2019-2020The dashboard can also be accessed HERE.\r\nMain Observations\r\nFrom the graphs, we noticed that the main exporter/importer for Singapore’s Merchandise Trade in 2019-2020 is Mainland China. The net calculations of trade volume between each year shows that America has the steepest decline in import trades, while Malaysia has the steepest decline for export trades.\r\nThe difference between exports and imports was also calculated, where it can be seen that Hong Kong has the largest difference between the two type of trades. The import volume is also extremely small compared to other countries.\r\nTrade balance is an economical indicator of the country’s growth, as it plays a part in influencing the value of currency in global markets as well creation of employment and economic growth. This indicator is measured by taking the exports minus imports volume. In this chart, the trade balance among the countries were plotted by the line graph across 2019-2020. With the origin axis as a baseline, we observe that:\r\nHong Kong experiences Trade Surplus throughout the entire time period, while Taiwan experiences a Trade Deficit within the same time period.\r\nInterestingly, America experiences Trade Deficit in 2019, but managed to overturn the situation and enter Trade Surplus in 2020.\r\n\r\n\r\nThat’s all for my dataviz makeover #1 post! Thanks for reading :)\r\n\r\nReferences\r\nInternational Monetary Fund, Singapore Merchandise Trade\r\nEconomics measurement of global trade\r\nWorld Integrated Trade Solution - measuring trade balance\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-06-06T01:25:43+08:00",
    "input_file": {}
  }
]
