[
  {
    "path": "posts/2021-05-22-dataviz-2/",
    "title": "DataViz 2",
    "description": "A short description of the post.",
    "author": [
      {
        "name": "Lim Jiahui, Masters of IT in Business (Analytics)",
        "url": "https://www.linkedin.com/in/lim-jiahui-171104151/"
      }
    ],
    "date": "2021-05-22",
    "categories": [],
    "contents": "\r\nDistill is a publication format for scientific and technical writing, native to the web.\r\nLearn more about using Distill at https://rstudio.github.io/distill.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-05-22T11:23:55+08:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-05-21-dataviz-makeover-1/",
    "title": "DataViz Makeover #1",
    "description": "Changing of SingStat's Merchandize Trade Visualization using R and Tableau.",
    "author": [
      {
        "name": "Lim Jiahui, Masters of IT in Business (Analytics)",
        "url": "https://www.linkedin.com/in/lim-jiahui-171104151/"
      }
    ],
    "date": "2021-05-21",
    "categories": [],
    "contents": "\r\n\r\nContents\r\n1. Introduction\r\n2. Evaluation2.1 Clarity\r\n2.2 Aesthetics\r\n\r\n3. Proposed Visualization Design3.1 Sketched Design\r\n3.2 Advantages of New Design\r\n\r\n4. Step-by-Step Methodology4.1 Data Source\r\n4.2 Data Preparation\r\n4.3 Data Visualization\r\n4.4 Dashboard\r\n\r\n5. Final Visualization\r\n\r\n\r\nThis post was written as part of requirements for Visual Analytics course in MITB.\r\n\r\n1. Introduction\r\nFor many countries, Singapore serves as an important port for trades and also heavily rely on imported goods for the country’s usage. Trades primarily consist of imports and exports, where imports refer to goods brought into Singapore irrespective of the uses, while exports refer to goods brought out of the country. In order to understand the movement of goods in Singapore, data visualization is important to help us discover meaningful insights that could potentially drive better decision-making and improvement of Singapore’s trades.\r\nIn this post, the original visualization chart of Singapore’s Merchandise Trade from SingStat will be critically reviewed and an improved alternative design will be proposed.\r\n2. Evaluation\r\nThe original chart is as shown below, and it mainly consists of top 6 trading countries between a time period of 2019-2021. The graphs were plotted based on their exports and imports across the time period.\r\n\r\n\r\n\r\nFigure 1: Original Chart\r\n\r\n\r\n\r\nBefore evaluating the chart, primary research on the visualization was conducted in order to understand what are the purposes of this graph as well as key takeaways for the readers.\r\nAudience: Government Agencies, policy-makers, businesses and individuals\r\nPurpose: To have a clear overview on changes in trade volume (between exports and imports) of Singapore and its top 6 countries between 2019 to 2021, especially since it was during the Covid-19 pandemic.\r\n2.1 Clarity\r\nS/N\r\nCritique\r\nApproach\r\n1\r\nCell 3\r\n\r\n2\r\nCell 4\r\n\r\n2.2 Aesthetics\r\n3. Proposed Visualization Design\r\n3.1 Sketched Design\r\n3.2 Advantages of New Design\r\n4. Step-by-Step Methodology\r\n4.1 Data Source\r\nThe raw excel data was downloaded from SingStat, and a preview of how the data looks like is shown below.\r\n\r\n\r\n\r\nFigure 2: Singapore Exports from 1976\r\n\r\n\r\n\r\n\r\n\r\n\r\nFigure 3: Singapore Imports from 1976\r\n\r\n\r\n\r\nAs observed, the data dated back from 1976 till 2021 in monthly basis. There are also many missing data (represented by “na”) and unnecessary top few rows.\r\n4.2 Data Preparation\r\n4.3 Data Visualization\r\n4.4 Dashboard\r\n5. Final Visualization\r\n3 Main Observations\r\n\r\n\r\n\r\n",
    "preview": "posts/2021-05-21-dataviz-makeover-1/img/originalchart.png",
    "last_modified": "2021-05-23T14:12:15+08:00",
    "input_file": "welcome.knit.md"
  }
]
