[
  {
    "path": "posts/2021-05-22-dataviz-2/",
    "title": "DataViz 2",
    "description": "A short description of the post.",
    "author": [
      {
        "name": "Lim Jiahui, Masters of IT in Business (Analytics)",
        "url": "https://www.linkedin.com/in/lim-jiahui-171104151/"
      }
    ],
    "date": "2021-05-22",
    "categories": [],
    "contents": "\r\nDistill is a publication format for scientific and technical writing, native to the web.\r\nLearn more about using Distill at https://rstudio.github.io/distill.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-05-22T11:23:55+08:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-05-21-dataviz-makeover-1/",
    "title": "DataViz Makeover #1",
    "description": "Changing of SingStat's Merchandize Trade Visualization using R and Tableau.",
    "author": [
      {
        "name": "Lim Jiahui, Masters of IT in Business (Analytics)",
        "url": "https://www.linkedin.com/in/lim-jiahui-171104151/"
      }
    ],
    "date": "2021-05-21",
    "categories": [],
    "contents": "\r\n\r\nContents\r\n1. Introduction\r\n2. Evaluation2.1 Clarity\r\n2.2 Aesthetics\r\n\r\n3. Proposed Visualization Design3.1 Sketched Design\r\n3.2 Advantages of New Design\r\n\r\n4. Step-by-Step Methodology4.1 Data Source\r\n4.2 Data Preparation\r\n4.3 Data Visualization (First Chart)\r\n4.4 Data Visualization (Second Chart)\r\n4.5 Dashboard\r\n\r\n5. Final Visualization\r\n\r\n\r\nThis post was written as part of requirements for Visual Analytics course in MITB.\r\n\r\n1. Introduction\r\nFor many countries, Singapore serves as an important port for trades and also heavily rely on imported goods for the country’s usage. Trades primarily consist of imports and exports, where imports refer to goods brought into Singapore irrespective of the uses, while exports refer to goods brought out of the country. In order to understand the movement of goods in Singapore, data visualization is important to help us discover meaningful insights that could potentially drive better decision-making and improvement of Singapore’s trades.\r\nIn this post, the original visualization chart of Singapore’s Merchandise Trade from SingStat will be critically reviewed and an improved alternative design will be proposed.\r\n2. Evaluation\r\nThe original chart is as shown below, and it mainly consists of top 6 trading countries between a time period of 2019-2021. The graphs were plotted based on their exports and imports across the time period.\r\n\r\n\r\n\r\nFigure 1: Original Chart\r\n\r\n\r\n\r\nBefore evaluating the chart, primary research on the visualization was conducted in order to understand what are the purposes of this graph as well as key takeaways for the readers.\r\nAudience: Government Agencies, policy-makers, businesses and individuals\r\nPurpose: To have a clear overview on changes in trade volume (between exports and imports) of Singapore and its top 6 countries between 2019 to 2021, especially since it was during the Covid-19 pandemic.\r\n2.1 Clarity\r\nS/N\r\nCritique\r\nApproach\r\n1\r\nCell 3\r\n\r\n2\r\nCell 4\r\n\r\n2.2 Aesthetics\r\n3. Proposed Visualization Design\r\n3.1 Sketched Design\r\n3.2 Advantages of New Design\r\n4. Step-by-Step Methodology\r\n4.1 Data Source\r\nThe raw excel data was downloaded from SingStat, and a preview of how the data looks like is shown below.\r\n\r\n\r\n\r\nFigure 2: Singapore Exports from 1976\r\n\r\n\r\n\r\n\r\n\r\n\r\nFigure 3: Singapore Imports from 1976\r\n\r\n\r\n\r\nAs observed, the data was dated back from 1976 till 2021 in monthly basis. There are also many missing data (represented by “na”) and unnecessary top few rows.\r\n4.2 Data Preparation\r\nTo facilitate ease of data preparation, the raw dataset will first be uploaded onto Tableau Prep Builder for data selection. The steps noted below are based on table T1 (Imports Table), but the same steps can be applied for table T2 (Exports Table) as well.\r\nS/N\r\nTableau Prep Builder Description\r\n1\r\nClick on “Connect data”, followed by “Microsoft Excel” to upload the raw dataset.\r\n2\r\nDrag table T1 into the empty pane.Notice that Tableau did not capture the headers and variables properly, hence we can click on “Use Data Interpreter” at the left side of the page. The final preview of the table shows the proper table inputs and field names.\r\n3\r\nNow, we can create a workflow for filtering of the data based on relevancy.At the top of the page, click on the “+” sign and select “Clean Step”.The preview will now show the interpreter data table.\r\n4\r\nSince the original chart only focuses on top 6 countries, we should filter the countries accordingly too.At the variables column, select the “More Options”, followed by “Filter” and “Selected Values”. We will then select the countries accordingly (including the total trades) as shown in the diagram above.\r\n5\r\nIn addition, the data of interest ranges from 2019 onwards. Hence, we will select only the fields from “2019 Jan” to “2021 Apr” and remove the rest using the “Remove Fields” button on top. The final preview of the table is as shown below. \r\n6\r\nFinally, the table shows no “null” values and thus we can save this table into an external xlsx file for further exploration on Tableau Desktop. At the top, click on the “+” sign and select “Output”.  Select “xlsx” as the output type and navigate to the directory where you wish to save the file at.\r\nRepeat the same steps as above for the Export Table. For easier reference, we shall combine both Imports.xlsx and Exports.xlsx into one excel worksheet before uploading into Tableau Desktop.\r\nS/N\r\nTableau Desktop Description\r\n1\r\nImport the dataset into Tableau Desktop and drag the tables into the empty space as shown below. \r\n2\r\nTo facilitate cross-referencing in the graphs later, we will create a “Union” between the 2 tables. Click on the “New Union” at the side bar and drag in both Import and Export tables.Click “ok” and the output will look like the diagram below, which both tables values together. \r\n3\r\nNext, we will make the dates as rows by pivoting for the table. Select all the dates and right click followed by “Pivot”. The table will now look like this: We will then rename the column names accordingly for easier reference, as shown below. \r\n4\r\nNotice that the dates are in strings data type based on the tiny label “Abc” on the top left corner at the columns. In this case, we will convert the data type into “Date” format in both Export and Import. \r\n5\r\nWe can also change the data type of the Variables column from strings to country, as it might be easier for us to conduct geospatial mapping later. To do so, click on the “Abc” logo again and hover on the “Geographical role” to select on “Country/Region”. \r\n6\r\nIn addition, we can see that only America is expressed in Million Dollars (SGD), hence we will convert the rest into the same units (Million Dollars) since the numbers are relatively large. Select the values column and right click on the “Calculated Field” function.  Based on a brief scan across the table, it shows that America values are less than 5 figures, hence we can enter the syntax as this: After applying the changes, our table values now looks better. We shall rename the column names as well. \r\n7\r\nNow, we will rename the variables to make it shorter and easier to read. Select the variables column and right click on “Aliases”.A second window will pop up, and double click on the _“Value (Alias)” to edit the names accordingly. \r\n8\r\nAfter all the above steps, the final overview of the tables should look something like this: \r\nThe table is now ready to be used for constructing of visualizations.\r\n4.3 Data Visualization (First Chart)\r\nOverall comparison between Exports and Imports\r\n4.4 Data Visualization (Second Chart)\r\n4.5 Dashboard\r\n5. Final Visualization\r\n3 Main Observations\r\n\r\n\r\n\r\n",
    "preview": "posts/2021-05-21-dataviz-makeover-1/img/originalchart.png",
    "last_modified": "2021-05-26T23:43:17+08:00",
    "input_file": "welcome.knit.md"
  }
]
