[
  {
    "path": "posts/2021-05-22-dataviz-2/",
    "title": "DataViz Makeover #2",
    "description": "A second evaluation of Singapore's Merchandize Trade over a longer timeline and more countries.",
    "author": [
      {
        "name": "Lim Jiahui, Masters of IT in Business (Analytics)",
        "url": "https://www.linkedin.com/in/jiahui-lim-450/"
      }
    ],
    "date": "2021-06-18",
    "categories": [],
    "contents": "\r\n\r\nContents\r\n1. Introduction\r\n2. Evaluation2.1 Clarity\r\n2.2 Aesthetics\r\n\r\n3. Proposed Visualization Design3.2 Advantages of New Design\r\n\r\n4. Step-by-Step Methodology4.1 Data Source\r\n4.2 Data Preparation\r\n4.3 Data Visualization (1st Chart)\r\n4.4 Data Visualization (2nd Chart)\r\n4.5 Dashboard\r\n\r\n5. Final VisualizationMain Observations\r\n\r\n\r\n\r\nThis post was written as part of requirements for Visual Analytics course in MITB.\r\n\r\n1. Introduction\r\nFor many countries, Singapore serves as an important port for trades and also heavily rely on imported goods for the country’s usage. Trades primarily consist of imports and exports, where imports refer to goods brought into Singapore irrespective of the uses, while exports refer to goods brought out of the country. In order to understand the movement of goods in Singapore, data visualization is important to help us discover meaningful insights that could potentially drive better decision-making and improvement of Singapore’s trades.\r\nIn this post, the original visualization chart of Singapore’s Merchandise Trade from SingStat will be critically reviewed and an improved alternate interactive design will be proposed.\r\n2. Evaluation\r\nThe original chart is as shown below, where it consists of major trading regions (in picture shows top 10: China, Malaysia, United States, European Union, Taiwan, Korea, Japan, Indonesia, Thailand and Hong Kong) between a time period of January 2011 to December 2020.\r\n\r\nFigure 2.1: Original Chart from Singstat\r\nBefore evaluating the chart, primary research on the visualization was conducted in order to understand what are the purposes of this graph as well as key takeaways for the readers.\r\nAudience: Government Agencies, policy-makers, businesses and individuals\r\nPurpose: To have a clear overview on which markets are the major net importers and exporters, as well as visualize the total trading volume with Singapore. The trade values used will be between a fixed time period of 2011 to 2020, as well as all trading markets with Singapore should be evaluated. The visualization will also be made interactive for selected views.\r\n2.1 Clarity\r\nS/N\r\nCritique\r\nApproach\r\n1\r\nUnclear chart title. From the screenshot, the chart title is missing but upon closer examination with the actual data source, the chart title states as “Merchandize Trade Performance with Major Trading Partners, 2020”. As the study period is from 2011-2020, the title is incorrect to put as 2020 only.\r\nWe will include the correct timeline of the study period, from 2011-2020.\r\n2\r\nConfusing use of circles to represent size of the trade volume, as this causes lots of overlapping. In addition, the white circle in the middle cannot be used to clearly differentiate whether the region is a net importer or exporter.\r\nWe will be using distinctive bar graphs to better show the ranking in trade volume as well as differentiating net exporters and importers.\r\n3\r\nCaptions/Notes are misleading. It is positioned at the bottom of the graph and the captions does not match the graph. We cannot tell whats the trend like in 2009 and 2006, based on the screenshot caption.\r\nWe will be using a yearly filter that allow us to see how the trend changes over the years for better comparison.\r\n4\r\nUnclear axis labels. The position of the x- and y-axis labels are position at the origin which makes it unclear. In addition, there are missing units of the labels.\r\nWe will be positioning the labels in the center of graph, as well as adding units (in this case SGD Billion).\r\n2.2 Aesthetics\r\nS/N\r\nCritique\r\nApproach\r\n1\r\nWrong choice of opaque colours used for the circles. Because of the overlapping circles, the opaque colours make it worse as we can’t see what’s behind. In addition, the diagonal reference line is also covered and hard to tell where the white circle lies.\r\nFor the makeover, we will abstain from using circles to differentiate trade volume and thus overlapping chances are very slim so this issue won’t be of concern.\r\n2\r\nSmall Font Size. The font size for “Net Importers” and “Net Exporters” are very small and they are position right at the extreme corners of the graph, making it visually hard to read.\r\nInstead of writing it down, we will be using a graph directly to show the regions that are net importers or net exporters.\r\n3\r\nHard to distinguish regions by colours. The colours of some circles looks very similar, for instance, Thailand and EU. This could be misleading for the viewers.\r\nWe will use as wide range of colours for more distinct outlook.\r\n3. Proposed Visualization Design\r\nFigure 3.1: Draft Design of the Proposed New Visual3.2 Advantages of New Design\r\nInstead of using circle plots, we will be using bar/line graph and lollipop chart. This gives better visibility to see the size of trade volume across different regions and continents. There will not be any overlapping and the sizes are sorted in order, allowing us to better see the top trading partners.\r\nInstead of squeezing the net exporters and importers onto one graph with the trade volume, we will be seperating them. This will prevent any overlapping as well as better show the distinctive ranking of top regions based on the criteria we are interested in (trade volume, net exporter and net importer), since they may not be the same (eg. China is top in trade volume but neither a top exporter or importer).\r\nThe new design includes many filters and highlighted features for a more interactive view. This also includes filtering the regions based on their continent. With this aspect, the viewer can see the countries of interest based on continent instead of searching through the mixture of regions.\r\nWe will also be adding in descriptions and chart titles to better summarize what the plot wishes to see so that the viewer can better understand and fully interact with the plot.\r\nClick HERE to see the screenshot of new design, as well as the link to the interactive version on Tableau Public.\r\n4. Step-by-Step Methodology\r\n4.1 Data Source\r\nWe will be using the same datasets of “import.csv” and “export.csv” as DataViz Makeover #1.\r\n4.2 Data Preparation\r\nAs the raw dataset consists of multiple unwanted rows, columns and ‘NA’ values, we will be doing some pre-processing on Tableau Desktop. For the purpose of this interactive visualization, we will be using all trading markets in the dataset.\r\n\r\nSteps\r\nDescription\r\n1\r\nImport the raw dataset into Tableau Desktop. From there, we can see 2 different tables - T1 and T2.Click on New Union and drag both T1 and T2 and select Apply.\r\n2\r\nThe data table will be stacked and it should look something like this:  Notice that the structure of the table is wrong, thus we can click on Cleaned with Data Interpreter at the side pane and it will automatically detect the exact table structure.The data table should now look like this:\r\n3\r\nWe will now filter the dates to January 2011 to December 2020. Shift and hold to select all unwanted columns, right click and select Hide. \r\n4\r\nTo convert the date columns to rows, we will use the Pivot function by right clicking the selected columns.  We can then rename the pivoted columns accordingly.\r\n5\r\nThen, we shall rename the variables to shorter words for simiplicity and uniformity. Initially, the namings of the regions are very long and inconsistent as shown below. As there are many regions, it will take alot of time to rename all individually. Hence, we shall use the split function in Tableau.  Great! Now tableau has automatically seperate the units and the region names. At the top right hand of the column, click on the tiny triangle and select Aliases.  Now, we can check through the namings and rename those longer ones to their acronyms or shorter version. Note: There are few regions that requires some prior knowledge and research before renaming, eg. Commonwealth of Independent States (CIS) is a group of states together, and Democratic People’s Republic of Korea is North Korea.  The final names should look like this:  We shall rename this new column as ‘Markets’.\r\n7\r\nAlso, we can rename the Table Name to ‘Type’ and change the aliases from T1 and T2 to Exports and Imports accordingly.\r\n8\r\nAfter split function above, notice that the 2nd variable columns becomes like this:  Hence, we shall filter those out to tidy up our table. At the top right corner of the page, click on Add under Filter.  Select Variables Split 2 and check on the Million and Thousand only.  After that, click on Ok to apply.\r\n9\r\nNote that the SGD values recorded are not consistent, where some are in SGD Millon Dollars, while the rest are in SGD Thousands. As the numbers are all big, we will standardize across all values to SGD Billion Dollars. Create a Calculated Field from the mini triangle again.  We can enter the following formula to the field using if-else function and click Apply. \r\n10\r\nLastly, we shall change the Data type for the Date, from strings to Datetime format. \r\n\r\nViola! Our data is well-prepped and ready to be used for visual constructions.\r\n4.3 Data Visualization (1st Chart)\r\nFor this first chart, we will be examining the net exports and imports trade value based on each individual markets, using a horizontal diverging lollipop chart.\r\nSetting up the Plot\r\nOpen up a fresh empty worksheet, and drag Markets into Rows and Filters pane. Because we want to compare between the markets individually, we will filter out the Total Exports and Imports, as well as the Continents (Europe, Asia, America, Oceania, Africa). The filters should look like below, and once all is selected properly, click on Apply.\r\n\r\nFigure 4.3.1: Filtering Variables\r\nNext, we will create a calculated field to show the net trade values. Right-click onto the Data pane and click on Create Calculated Field. We will use an if-else function to multiply the SGD value to negative if it its imports (aka sheet = ‘T1’). Hence, we can apply the formula as shown in Fig 4.3.3 and rename it to “Net Trade Indicator”.\r\n\r\nFigure 4.3.2: Creating Calculated FieldFigure 4.3.3: Inputting if-else functions\r\nNow, drag the “Net Trade Indicator” into the Columns, and you can see a diverging bar chart already. In order to make it a lollipop shape, we have to use dual axis. Drag “Net Trade Indicator” again to columns to create this effect, but change the marks as “Circle” instead and thus it should look something like Fig 4.3.4.\r\n\r\nFigure 4.3.4: Creating dual axis with different markings\r\nNow, lets join them together into one axis. Right click on the x-axis and select on Dual Axis. After that, remember to Synchronize Axis so that the plots appear together in sync.\r\n\r\n\r\nFigure 4.3.5: Making into one axis and Synchronize\r\nNote that after combining them, the shapes of the chart might be different. Do make sure that one of them is a circle, while the other is a bar graph. You can make the changes under the individual Marks pane (do not change the All marks pane!).\r\n\r\nFigure 4.3.6: Making into one axis\r\nNext, we shall alter the size and colour for the charts. For the lollipop shape, we need the bar graph to be very thin while the circle to be larger. We can make the necessary changes in its individual Marks pane as well, under Size tab. We can also change the colours under Color accordingly to make the stem and head more distinct. Once the changes has been made, we have achieved our lollipop shape!\r\n\r\n\r\nFigure 4.3.7: Changing colours and sizesFigure 4.3.8: Lollipop Shape\r\nAs the original purpose of the graph is to see Singapore’s Major trading partners, we shall now create a parameter called “Top N Trading Partners”. This parameter can also be used as a filter to change the N value based on what the viewer wish to see.\r\nRight click at the Data Pane and select Create Parameter.\r\nWe shall create a list with integers from 5-20 with stepsize of 5.\r\nIn order to allow it to work as a filter for Markets variable, we can edit the Markets filter by navigating to the Top tab and select the By field, changing it to the name of the parameter we just created.\r\nAs we are interested in filtering by Total Sum of Imports and Exports value, we can select that condition under by drop down menu as well.\r\n\r\n\r\n\r\nFigure 4.3.9: Creating a list parameter\r\nFigure 4.3.10: Adding parameter into the filter\r\nLet us now tidy up our graphs but adding the directional colours, labels and filters.\r\nFirstly, we can change the colours based on the direction by dragging in “Net Trade Indicator” into the Color tab for the Circle graph. Click on the colour legend and change it into two-step colours.\r\nThen, we shall drag the “Net Trade Indicator” into the Label tab for Circle graph and realign it to center.\r\nAs the numbers are quite long, we shall alter them into whole numbers for easier viewing. Right-click on the x-axis and select Format. Under the Default, we can customize the appearance of the numbers.\r\nLastly, we shall add our filters. Click on the parameter and select Show Parameter. We are also interested to see the changes across time, hence lets drag the Date variable into the Filters and display the years as a single value list.\r\n\r\n\r\n\r\nFigure 4.3.11: Changing of Colours and Label layout\r\nFigure 4.3.12: Making the labels to whole numbers\r\nFigure 4.3.13: Adding filters\r\nTo make our graph visibly clearer for readers, we shall add in a reference line as well as color-coded sections.\r\nRight click onto the x-axis and select Add Reference Line.\r\nEdit the parameters by changing the value to a constant 0, dotted line, as well as filled colours as shown in Fig 4.3.15.\r\n\r\n\r\nFigure 4.3.14: Adding a reference lineFigure 4.3.14: Editing appearance of reference line and graph\r\nInserting Tooltip\r\nLet’s now make the visual more interactive with the use of tooltips. We can edit the tooltip manually or by adding calculated fields.\r\nFirst, we can create a calculated field that will differentiate net importers and exporters. Right-click on the data pane and select Create Calculated Field. Then, we can input the formula as shown below, naming it as Net Trade_Type:\r\n\r\nFigure 4.3.15: Calculated field for Tooltip\r\nDrag this field into the Tooltip tab under Marks pane, and click on the tab. We shall edit the tooltip by clicking onto Insert and select the various fields highlighted. We can also further beautify the tooltip with bolding, colours and changing of font size etc. Our final edit will look similar to Fig 4.3.16.\r\n\r\nFigure 4.3.15: Inserting fields into TooltipFigure 4.3.15: Inserting fields into Tooltip\r\nFinal Graph\r\nAnd now our first chart is done! After a few finishing touches (hiding the top axis, renaming chart title, sort in descending), our final static diverging lollipop graph will look like this:\r\nFigure 4.3.17: Final Static Lollipop Graph for Net Trade Value4.4 Data Visualization (2nd Chart)\r\nMoving on to the second chart, this graph will visualize the overall performance of each trading partners with Singapore via a bar and line chart combined together. We will also be using the same parameter filter and year filter for this chart.\r\nSetting up the Plot\r\nCreate an empty sheet, and drag the Markets into the Columns panes. Similarly, we will filter the continents as well as total exports and imports out to focus on trading partners only. We can also add in the Date into Filters and also show the parameter as a filter as well, similar to the above chart.\r\nNext, we shall generated two calculated fields, one for exports and the other for imports. We can simply divide them based on an if-else function for calculated fields as shown below.\r\n\r\n\r\nFigure 4.4.1: Calculations for Imports and Exports\r\nFrom here, we shall drag the Measures Values straight into the Rows pane. Note that there will many values, and thus we will drag all out except for the Exports and Imports. We can then change the type of graph to a line chart, and it should like something below:\r\n\r\nFigure 4.4.2: Line Graphs\r\nNow, we shall add in the bar graph. Drag in SGD (Billion) into the Rows after the Measure Values. We can change the type of graph to bar chart, and also perform Dual Axis and Synchronize Axis.\r\nMake sure to change the colours of the graph to make it more visible. Drag Type into the Color tab under the line graph Marks pane to get a distinguished colour for type of trade.\r\nAdditionally, sort the bar graph so that it appears in descending order. We can do so by clicking at the tiny icon beside the y-axis name of the bar chart.\r\n\r\n\r\n\r\nFigure 4.4.3: Formatting the Bar Graph into same axis\r\nIn order to make our graph more interactive, we shall add in an additional filter (that will also be used with the above chart simultaneously) that allow the users to choose the continent. Each continent will also contain the respective countries and regions, which can be found HERE.\r\nTo do so, we will need to use the Group function and manually group them accordingly.\r\nWith reference to the link, we can group all regions into 5 continents: Asia, Africa, Europe, America and Oceania. Those that does not fit will be pushed to “-” category which we won’t be touching at all.\r\nEventually, we will want to achieve something like Fig. 4.4.4.Rename the column as Continents.\r\n\r\n\r\n\r\nFigure 4.4.4: Grouping into 5 continents\r\nNext, we would want to add in this grouped data as a filter. Drag Continents into the Filters. As we want to allow Top N Trading Partners filter to be used together with the Continents filter, click on the mini triangle of the Continents filter and select Add to Context. Viola!! The top N partners shown will be based on the continents selected.\r\n\r\nFigure 4.4.5: Linking up both “Continents” and “Top N Trading Partners” filters\r\nInsert ToolTip\r\nSimilarly, we would want to let our tooltips give a brief summary of the graphs.\r\nClick onto the tooltip for the bar chart and edit it to the style you wish for it to see. You can also edit the line chart accordingly. One sample of the final output is shown below:\r\n\r\n\r\nFigure 4.4.6: Creating tooltips for Bar and Line Graph accordingly\r\nFinal Graph\r\nFinally, we are done with the second chart! It is much easier as we have already generated the filters from previous chart. After some minor touch ups (renaming title, edit colours), the chart should look something like this:\r\nFigure 4.4.7: Final Static Bar and Line Graph4.5 Dashboard\r\nFinally, lets compile all of our charts into the dashboard and make some final adjustments to the interactive portions.\r\nCreate an empty dashboard and drag in the “Trade Value” and “Net Trade Value” worksheets. For this dashboard, we will be using a fixed size of Generic Desktop (1366 x 168) due to the volatility of the net trade value which will cause some compression if sizing is set to automated. We will also check the Show Dashboard title and drag in Blank or Text objects to create spaces and captions.\r\n\r\n\r\nFigure 4.5.1: Defining the sizing and dragging in tools for constructions\r\nAfter dragging the charts in and arrange them side-by-side, we would want to alter the filters to ensure that it applies to both charts together. Right click on each filter, go to Apply to Worksheets and either choose All Using This Data Source or select the worksheets on the dashboard.\r\n\r\nFigure 4.5.2: Formatting the filters to be applied for both charts\r\nNext, let’s do some highlighting to make the visual more interactive.\r\nFirst, lets make sure that the legend can be highlighted so that the bar and line graph can be shown distinctly.\r\nNext, we will create a Highlight from Actions using Markets as selected fields for both “Trade Value” and “Net Trade Value”.\r\n\r\n\r\nFigure 4.5.3: Highlighting of legend\r\nFigure 4.5.4: Creating Highlighted Action\r\nNotice that when we click onto the filters, the transitions are not very smooth? We can fix that by adding in Animations from the Format tab, followed by turning On the workbook default.\r\n\r\n\r\nFigure 4.5.5: Creating Animations\r\nNext, we will add in an info icon that will display useful information when hovered. This is not only an interactive feature, but also due to dashboard constraints, we can add in more information via the hover function.\r\nCreate an empty worksheet and rename it to “Info”.\r\nCreate a calculated field and we will type in “Info”. Apply the calculation.\r\nDrag Info into the Rows pane. Right click on the sheet to hide away the title and header.\r\nWe will then change the Marks Pane to Shape, followed by clicking onto the Shape tab to select the type of shape we want.\r\nWe can further format the sheet by removing the gridlines as well as changing the background colour by right-clicking select Format.\r\nTo make it hoverable with the correct information, we shall edit the Tooltip accordingly.\r\nHence, the final text format for this icon should look something like in Fig 4.5.8.\r\n\r\n\r\n\r\nFigure 4.5.6: Formatting of the worksheet\r\nFigure 4.5.7: Creating ShapeFigure 4.5.8: Final Hover Information from Worksheet\r\nNext, we shall include a graphical illustration into the hover information. To do so, we need to create a new graph from a new worksheet.\r\nDrag Date and Measure Values into the Columns and Rows pane respectively.\r\nRemove unwanted measured values so that only Exports, Imports and Total (SGD Billion) are left in the graph.\r\nWe shall annotate the graph, such that the lines are distinct. Drag the Measure Names and Measure Values into the Label tab. We can also drag in Measure Names to the Color tab to allow colours to distinguish the different trade types.\r\nAs we notice fluctuations at 2016 and 2018, we shall add in reference lines at those points. First, we change the Date type to continuous and then right-click on the axis to Add Reference Line.\r\nSelect the value to be a Constant and the date to be at the beginning of the respective year (eg. 1/1/2016). We can display the label to be the constant value and format the line to dotted as well as thinner line.\r\nThe final overview should look something like Fig 4.5.13.\r\n\r\n\r\nFigure 4.5.10: Constructing of Line Graphs for Exports, Imports and Total TradeFigure 4.5.11: Annotating the Graph\r\nFigure 4.5.12: Adding Reference LinesFigure 4.5.13: Final Overview\r\nAfter that, to include this graph into the tooltip, we shall go to the “Info” sheet’s tooltip, select Insert, Sheets and click onto the line graph.\r\n\r\nFigure 4.5.14: Adding graph into Tooltip\r\nFinally, let’s input this hover icon into the dashboard.\r\nDrag in the “Info” sheet into the dashboard and change the format to Floating so that we can position it to where we want.\r\nHide away the title of the sheet.\r\nLet’s also include a caption by dragging in the Text object, making it floating as well and edit it accordingly.\r\n\r\n\r\n\r\nFigure 4.5.9: Inserting the icon into Dashboard\r\nWell done!! We are now set up for the visualization and ready to evaluate the observations we see!\r\n5. Final Visualization\r\nThe final visualization screenshot is as shown below, and the interactive version can be accessed HERE.\r\nFigure 5.1: Final Dashboard (Static Image)Main Observations\r\nOverall observations:\r\nFrom 2011-2020, the top 20 trading partners are mainly located in the Asia Continent.\r\nOverall trend in trade dips in 2016 and increases sharply in 2018. The dip might be due to worldwide events, such as economic slowdown in China, falling oil prices and lower demand in Asia.\r\nIn addition, the increase might be affiliated to the implementation of Trans-Pacific Agreement. WTO research shows that increased spending mainly from US (with reference to the agreemnt) and rising consumption rate from Japan has contributed to strong growth in trades from 2017-2018.\r\n\r\n\r\n\r\n\r\nTop Trading Partner(s): China (2013-2020), Malaysia (2011-2012)\r\nAs Malaysia is Singapore’s nearest neighbour, it is no surprise that the trade volume of Malaysia is generally within the Top 5 rank across the years.\r\nMalaysia was ranked 1st in 2011, but China eventually took over from 2013 onwards. The sudden increase from China might be due to the Singapore-China Free Trade Agreement (FTA) amendment in 2011 and China’s ever-growing economy and demand from manufactured goods.\r\nInterestingly, the FTA from here states that new benefits were added to the FTA from late 2019, which should cause the trade with China to be better, but the trade volume slightly decrease from SGD 137B in 2019 to SGD 136B in 2020. This might coincide with the outbreak of Covid-19 in Wuhan during Dec 2019 and eventually causes country-wide lockdown in China.\r\n\r\nTop Net Exporter: Hong Kong\r\nHong Kong has been Singapore’s top exporter from 2011-2020, where the average exports volume remains stable at around SGD 50 billion. The highest trade surplus recorded was in 2018, with a surplus value of SGD 60B.\r\n\r\nTop Net Importer: US (from 2011-2017),Taiwan from (2018-2020)\r\nIn 2011-2017, the trade deficit value of US slowly increases from SGD -20B to SGD -15B, holding the top importer position until 2018 where Taiwan took over with a trade deficit of SGD -20B. The trade deficit value of Taiwan has then been decreasing since 2018 to 2020, hitting a new low of SGD -25B in 2020.\r\n\r\n\r\nThat’s all for my dataviz makeover #2 post! Thanks for reading :)\r\n\r\nReferences\r\nStatista\r\nDataViz Peer Learning\r\nCountries/Regions for each Continent\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-06-19T18:36:39+08:00",
    "input_file": "dataviz-2.knit.md"
  },
  {
    "path": "posts/2021-05-21-dataviz-makeover-1/",
    "title": "DataViz Makeover #1",
    "description": "Changing of SingStat's Merchandize Trade Visualization using R and Tableau.",
    "author": [
      {
        "name": "Lim Jiahui, Masters of IT in Business (Analytics)",
        "url": "https://www.linkedin.com/in/lim-jiahui-171104151/"
      }
    ],
    "date": "2021-05-21",
    "categories": [],
    "contents": "\r\n\r\nContents\r\n1. Introduction\r\n2. Evaluation2.1 Clarity\r\n2.2 Aesthetics\r\n\r\n3. Proposed Visualization Design3.1 Sketched Design\r\n3.2 Advantages of New Design\r\n\r\n4. Step-by-Step Methodology4.1 Data Source\r\n4.2 Data Preparation\r\n4.3 Data Visualization (First Chart: Trade Volume and Balance)\r\n4.4 Data Visualization (Second Chart: Net Trade Volume)\r\n4.5 Dashboard\r\n\r\n5. Final VisualizationMain Observations\r\n\r\n\r\n\r\nThis post was written as part of requirements for Visual Analytics course in MITB.\r\n\r\n1. Introduction\r\nFor many countries, Singapore serves as an important port for trades and also heavily rely on imported goods for the country’s usage. Trades primarily consist of imports and exports, where imports refer to goods brought into Singapore irrespective of the uses, while exports refer to goods brought out of the country. In order to understand the movement of goods in Singapore, data visualization is important to help us discover meaningful insights that could potentially drive better decision-making and improvement of Singapore’s trades.\r\nIn this post, the original visualization chart of Singapore’s Merchandise Trade from SingStat will be critically reviewed and an improved alternative design will be proposed.\r\n2. Evaluation\r\nThe original chart is as shown below, and it mainly consists of top 6 trading countries between a time period of 2019-2021. The graphs were plotted based on their exports and imports across the time period.\r\nFigure 2.1: Original Chart from SingstatBefore evaluating the chart, primary research on the visualization was conducted in order to understand what are the purposes of this graph as well as key takeaways for the readers.\r\nAudience: Government Agencies, policy-makers, businesses and individuals\r\nPurpose: To have a clear overview on changes in trade volume (between exports and imports) of Singapore and its top 6 countries between 2019 to 2021, especially since it was during the Covid-19 pandemic.\r\n2.1 Clarity\r\nS/N\r\nCritique\r\nApproach\r\n1\r\nWrong choice of graph type (original chart uses area graph), as this causes overlapping and makes it difficult to read the values\r\nChange the graph type to either bar chart or line chart to show distinct changes. Additionally, plot the imports and exports separately so as to have a clearer view for each type of trade.\r\n2\r\nThe overlapping of area graph introduces a new color, which is also not included in the legend properly.\r\nEnsure all variables are labeled/annotated/represented properly in the chart.\r\n3\r\nValues in Axes on both ends have different units, thus making it hard to read\r\nSynchronize the axis and convert all values for imports and exports to the same units.\r\n4\r\nInconsistent representation of the time period among all countries. Japan has only time period of 2020, while the rest consists of trades from 2019-2020. This reduced the accuracy in the comparison between all 6 countries.\r\nClean up data and re-organize it to make sure ALL countries’ data are included.\r\n5\r\nLegend title is named as “Measure Names”, which is clearly misleading.\r\nNaming of the legends need to be edited properly.\r\n6\r\nThe title of each graph is just the country names, but does not annotate what the graph actually means.\r\nInclude a clear title that summarizes the whole plot.\r\n2.2 Aesthetics\r\nS/N\r\nCritique\r\nApproach\r\n1\r\nSize of all 6 charts are relatively small and hard to read.\r\nThis might be due to each country being plotted separately, hence we will combine all to make into a single plot of same axis.\r\n2\r\nFont size used in the Chart Header is almost as big (or smaller) as the headings for each graph.\r\nBold the chart header and use a bigger font size to represent the main objective of the graph.\r\n3\r\nMany blank areas and chart design is too “empty”.\r\nFill in the white spaces with some descriptions/captions/annotations, and also highlight any key features for the readers to take note of (eg. using different colours to represent increase/decrease)\r\n3. Proposed Visualization Design\r\n3.1 Sketched Design\r\nFigure 3.1.1: New Proposed Design on Sketch3.2 Advantages of New Design\r\nThere will be a clear title for the overall chart, including the 2 plots as well. Axes and legends will also be labeled properly. This will thus let the readers have a clearer understanding of the plots.\r\nThere will also be a few short captions/descriptions for the charts. This will thus provide more context to the overall plots.\r\nIn this new design, we will be able to see the distinct changes in exports and imports trade volume per country on the same plot. There won’t be any overlaps and thus making it easy to read.\r\nAs the imports and exports are all on the same chart, the timeline used will also be consistent for fair comparison. The axes will also be synchronized across all countries and converted to a better unit of measurement (SGD Billion) so that the numbers will not be too big for reading.\r\nThe use of colours will be introduced into the chart to highlight certain areas as well as showing of notable features.\r\n4. Step-by-Step Methodology\r\n4.1 Data Source\r\nThe raw excel data was downloaded from SingStat, and a preview of how the data looks like is shown below.\r\nFigure 4.1.1: Singapore Exports from 1976Figure 4.1.2: Singapore Imports from 1976As observed, the data was dated back from 1976 till 2021 in monthly basis. There are also many missing data (represented by “na”) and unnecessary top few rows.\r\n4.2 Data Preparation\r\nTo facilitate ease of data preparation, the raw dataset will first be uploaded onto Tableau Prep Builder for data selection. The steps noted below are based on table T1 (Imports Table), but the same steps can be applied for table T2 (Exports Table) as well.\r\nS/N\r\nTableau Prep Builder Description\r\n1\r\nClick on “Connect data”, followed by “Microsoft Excel” to upload the raw dataset.\r\n2\r\nDrag table T1 into the empty pane.Notice that Tableau did not capture the headers and variables properly, hence we can click on “Use Data Interpreter” at the left side of the page. The final preview of the table shows the proper table inputs and field names.\r\n3\r\nNow, we can create a workflow for filtering of the data based on relevancy.At the top of the page, click on the “+” sign and select “Clean Step”.The preview will now show the interpreter data table.\r\n4\r\nSince the original chart only focuses on top 6 countries, we should filter the countries accordingly too.At the variables column, select the “More Options”, followed by “Filter” and “Selected Values”. We will then select the countries accordingly (including the total trades) as shown in the diagram above.\r\n5\r\nIn addition, the data of interest ranges from 2019 onwards. Hence, we will select only the fields from “2019 Jan” to “2021 Apr” and remove the rest using the “Remove Fields” button on top. The final preview of the table is as shown below. \r\n6\r\nFinally, the table shows no “null” values and thus we can save this table into an external xlsx file for further exploration on Tableau Desktop. At the top, click on the “+” sign and select “Output”.  Select “xlsx” as the output type and navigate to the directory where you wish to save the file at.\r\n\r\nTable 4.2.1: Tableau Prep Builder Steps\r\nRepeat the same steps as above for the Export Table. For easier reference, we shall combine both Imports.xlsx and Exports.xlsx into one excel worksheet before uploading into Tableau Desktop.\r\nS/N\r\nTableau Desktop Description\r\n1\r\nImport the dataset into Tableau Desktop and drag the tables into the empty space as shown below.\r\n2\r\nTo facilitate cross-referencing in the graphs later, we will create a “Union” between the 2 tables. Click on the “New Union” at the side bar and drag in both Import and Export tables.Click “ok” and the output will look like the diagram below, which both tables values together. \r\n3\r\nNext, we will make the dates as rows by pivoting for the table. Select all the dates and right click followed by “Pivot”. The table will now look like this: We will then rename the column names accordingly by double clicking at the headers for easier reference. \r\n4\r\nNotice that the dates are in strings data type based on the tiny label “Abc” on the top left corner at the columns. In this case, we will convert the data type into “Date” format in both Export and Import. \r\n5\r\nWe can also change the data type of the Variables column from strings to country, as it might be easier for us to conduct geospatial mapping later. To do so, click on the “Abc” logo again and hover on the “Geographical role” to select on “Country/Region”. \r\n6\r\nIn addition, we can see that only America is expressed in Million Dollars (SGD), while the rest are in Thousands. Hence, we will convert all the values into the same units (Billion Dollars) since the numbers are relatively large. Select the values column and right click on the “Calculated Field” function.  Based on a brief scan across the table, it shows that America values are less than 5 figures, hence we can enter the syntax as this: After applying the changes, our table values now looks better. We shall rename the column names as well. \r\n7\r\nNow, we will rename the variables to make it shorter and easier to read. Select the variables column and right click on “Aliases”.A second window will pop up, and double click on the _“Value (Alias)” to edit the names accordingly. \r\n8\r\nAfter all the above steps, the final overview of the tables should look something like this: \r\n\r\nTable 4.2.2: Tableau Desktop Steps\r\nThe table is now ready to be used for constructing of visualizations.\r\n4.3 Data Visualization (First Chart: Trade Volume and Balance)\r\nIn this first chart, we will be creating a line and bar chart congregated onto a single axis for an easier overview in both trade volumes and balance between exports and imports.\r\nSetting up of Plot\r\nOpen up the first sheet tab of Tableau, and we can see the Tables Pane like this:\r\n\r\nFigure 4.3.1: Setting up worksheet in Tableau\r\nDrag variables “Country”, “Date” and “SGD (Billion)” into the “Columns” and “Rows”, and you can see the plot as follows:\r\nFigure 4.3.2: Inputting Variables to plotNote that the date of interest is from 2019-2020, and only the top 6 countries to be selected. Hence, we will do a “Filters”, by dragging in “Country” and “Date” into the section. We will de-select on “Total Exports” and “Total Imports” for the “Country”, while de-selecting “2021” option in the Years for “Date”. We will then click on “Apply” and the changes will occur accordingly.\r\n\r\nFigure 4.3.3: Filtering VariablesFigure 4.3.4: Filtering Timeline\r\nNext, we will change the graph into a bar chart by selecting it from the “Marks” pane. We will also change the formatting for “Date” from the drop down, and als click on the “+” sign next to “Date” again to display the quarters as well. Hence, the steps and plot becomes like this:\r\n\r\nFigure 4.3.5: Bar ChartFigure 4.3.6: Altering the timelineFigure 4.3.7: Output of Bar Chart after changes to timeline\r\nIn order to plot both exports and imports on the same axis, we have to create a calculated field (right click at the left pane) as shown below in Figure 4.3.8.\r\nWe will then replace the variables in the rows, from “SGD (Billion)” to the new calculated field “Balance”.\r\nAfter that, drag the “Type” variable into the “Color” at Marks pane and we will get the diverging graph as seen in Figure 4.3.10.\r\n\r\n\r\nFigure 4.3.8: Creating calculated fieldFigure 4.3.9: Formula used in the calculated field named “Balance”Figure 4.3.10: Output after manipulation - Vertical Diverging Graph\r\nNow, we will add in the line graph that calculates the trade balance onto the same plot.\r\nDrag the “Balance” variable into the rows and change it into a line graph.Then, right click on the botton axis and click on “Dual Axis”.\r\nWe will also synchronize the axis to re-organize the chart by right clicking the axis.\r\nIn case the line graph doesn’t show, we can realign the order by formatting the axis and selecting the marks to be brought forwards.\r\nViola! We have our combined diverging chart ready! You can change the colours of the lines/bar graph to make it more prominent.\r\n\r\n\r\nFigure 4.3.11: Creating Dual Axis with Line Graph #1Figure 4.3.12: Creating Dual Axis with Line Graph #2Figure 4.3.13: Creating Dual Axis with Line Graph #3Figure 4.3.14: Creating Dual Axis with Line Graph #4Figure 4.3.15: Output of Line and Bar Graphs together on same axis\r\nCustomization\r\nTo distinguish the important features of the graph, we will change the colours or formatting to make the features more prominent and pleasing to the eye. There are 4 main features to go about: \r\nEditing the title of axes and adding in labels, markers:\r\nDrag the “Balance” variable into the “Label” portion at the Marks for line graph.\r\nAdd in markers (under “Color”) to the lines for better identification.\r\nEdit the axes title by double clicking it.\r\n\r\nChange the colours of the bar chart to colours that are more pleasing to the eye.\r\nAdd in differentiating colours for negative and positive values in the trade balance by dragging “Balance” to “Color” in the Marks pane. Edit the colors into 2 steps that centered at 0, as shown in Figure 4.3.16.\r\n\r\n\r\nFigure 4.3.16: Creating 2-stepped color\r\nChanging the labels on the axis to positive values:\r\nAs imports are positive values originally, we will edit it accordingly on the axis. Firstly, right click on either axis, then click “Format”.\r\nUnder the “Axis” section, select the “Numbers”, click “Custom” and enter the format as shown below in Figure 4.3.17.\r\n\r\n\r\nFigure 4.3.17: Reformatting axis to become all positive\r\nEdit the “Tooltip” to reflect the timeline, units, trade volume and balance.\r\nAfter all the steps above, the final chart should look something like this:\r\nFigure 4.3.18: Final Output of First Chart - Trade Volume and Balance4.4 Data Visualization (Second Chart: Net Trade Volume)\r\nThis chart will be a simple visualization to the net exports and imports per year across the different countries.\r\nSetting up of Plot\r\nOpen up an empty sheet and drag in “Country”, “Date” to columns while “Type” into the rows. (Refer to top few steps if unsure) Leave the dates as yearly values.\r\nAs usual, filter the years to 2019-2020 and remove both “Total Exports” and “Total Imports”.\r\nNote that a table of missing values is now created, thus we will drag in “SGD (Billion)” to the “Text” section in the Marks pane.\r\nTo create colours in visualizing the change of net trade volume, we will be switching to a highlight table instead. On the top right corner of the page, click on “Show Me” and select the “Highlight Table” as shown in the diagram below.\r\n\r\nFigure 4.4.1: Changing chart type to Highlighted Table\r\nGreat! Our second chart is almost done, just need to touch up on the colours and display!\r\nCustomization\r\nSimilar to the first chart, we would like our visuals to highlight the key features.\r\nChange the colours of the table.\r\nAt the Marks pane, edit the “SGD (Billion)” under “Colors” and compute using the difference across pane.\r\nWe will be using the full spectrum of the diverging colours by checking the “Use Full Color Range”.\r\n\r\n\r\nFigure 4.4.2: Computing difference across pane #1Figure 4.4.3: Computing difference across pane #2Figure 4.4.4: Creating diverging colors to show the differences\r\nAdding in Subtotals and Grand Totals\r\nTo show the overall values, we can add in the totals by clicking onto the tab “Analysis”, followed by “Totals” and selecting the “Add All Subtotals” as well as “Show Row Grand Totals”.\r\n\r\n\r\nFigure 4.4.5: Addition of Subtotals and Grand Totals to the Table\r\nRename the axes and title of the chart for better understanding. After all the steps above, the final chart should look something like this:\r\nFigure 4.4.6: Final output of Second Chart - Net Trade Volume4.5 Dashboard\r\nFinally, we can compile all the charts into the dashboard.\r\nFirst, open up an empty dashboard and set the size of it to “Automatic”.\r\n\r\nFigure 4.5.1: Empty New Dashboard pageFigure 4.5.2: Setting the size of Dashboard\r\nDrag in both sheets into the empty dashboard. Make sure to format the layout of all charts,legends and text into “Floating”. This will allow to resize and reorganize our dashboard easily to wherever we want.\r\n\r\nFigure 4.5.3: Creating “Floating” Charts and Diagrams\r\nInclude a header for the dashboard by checking the “Show dashboard title”.\r\n\r\nFigure 4.5.4: Including Dashboard Header\r\nInclude captions, text or description. To do so, drag the “Text” object into the dashboard and format it to “Floating”. Edit the text accordingly to information or findings from the chart.\r\n5. Final Visualization\r\nFigure 5.1: Singapore Merchandise Trade with Top Six Countries, 2019-2020The dashboard can also be accessed HERE.\r\nMain Observations\r\nFrom the graphs, we noticed that the main exporter/importer for Singapore’s Merchandise Trade in 2019-2020 is Mainland China. The net calculations of trade volume between each year shows that America has the steepest decline in import trades, while Malaysia has the steepest decline for export trades.\r\nThe difference between exports and imports was also calculated, where it can be seen that Hong Kong has the largest difference between the two type of trades. The import volume is also extremely small compared to other countries.\r\nTrade balance is an economical indicator of the country’s growth, as it plays a part in influencing the value of currency in global markets as well creation of employment and economic growth. This indicator is measured by taking the exports minus imports volume. In this chart, the trade balance among the countries were plotted by the line graph across 2019-2020. With the origin axis as a baseline, we observe that:\r\nHong Kong experiences Trade Surplus throughout the entire time period, while Taiwan experiences a Trade Deficit within the same time period.\r\nInterestingly, America experiences Trade Deficit in 2019, but managed to overturn the situation and enter Trade Surplus in 2020.\r\n\r\n\r\nThat’s all for my dataviz makeover #1 post! Thanks for reading :)\r\n\r\nReferences\r\nInternational Monetary Fund, Singapore Merchandise Trade\r\nEconomics measurement of global trade\r\nWorld Integrated Trade Solution - measuring trade balance\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-06-06T01:25:43+08:00",
    "input_file": {}
  }
]
